Revit 2027 API
ParameterTypeId.TextAlignment Property
 "Text Alignment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TextAlignment { get; }
Public Shared ReadOnly Property TextAlignment As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TextAlignment {
	ForgeTypeId^ get ();
}
static member TextAlignment : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace